read_verilog alu_32bit.v
synth -top alu_32bit

dfflibmap -liberty /home/dhiraj/pdks/open_pdks/sky130/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty  /home/dhiraj/pdks/open_pdks/sky130/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib

stat
write_verilog alu_32bit_synth.v
write_json alu_32bit_synth.json
write_sdc alu_32bit.sdc

